const data = {
    aside: {
        "0": {
            title: "문제 페이지에 들어가면 여기에 힌트가 표시됩니다."
        },
        "1": {
            title: "Semantic 요소의 종류",
            content: ["<header>", "<nav>", "<main>", "<aside>", "<footer>", "<section>", "<article>", "<hgroup>", "<p>"]
        },
        "2": {
            title: "자주 틀리는 마크업 예시",
            content: ["인라인 요소 안에 블록 요소 넣기", "<b>, <i> 요소 사용하기", "<hgroup> 마구잡이로 사용하기", "<br /> 연속으로 사용하기", "인라인 스타일링 사용하기"]
        },
        "3": {
            title: "적절한 대체 텍스트",
            content: ["텍스트가 아닌 콘텐츠는 그 의미나 용도를 이해할 수 있도록 대체 텍스트를 제공해야합니다.",
            "alt 속성 사용하기", "배경 이미지와 같이 정보를 인식할 필요가 없는 경우에는 alt 값으로 빈 문자열을 주어 스크린 리더가 인식하지 않게 합니다.", "정보 전달이 필요한 콘텐츠에 빈 문자열을 입력할 경우 해당 콘텐츠의 존재 자체도 인식하지 못하게 되므로 주의해야 합니다.", "인접 요소의 내용에서 이미지의 정보를 충분히 인지할 수 있는 경우에는 빈 문자열로 작성하는 것이 좋습니다."]
        },
        "4": {
            title: "콘텐츠 선형 구조",
            content: ["콘텐츠는 논리적인 순서로 제공해야합니다.",
            "글은 제목, 내용 순서로 제공되는 것이 논리적으로 맞습니다.", "탭에 해당하는 내용이 있는 경우, 탭 제목 다음에 탭 내용이 오도록 마크업을 구성해야합니다.", "스크린 리더는 마크업 순서대로 내용을 읽어준다는 것을 항상 고려해주세요."]
        },
        "5": {
            title: "WAI-ARIA",
            content: ["WAI-ARIA의 역할 속성은 해당 요소가 어떤 역할을 하는지 명시해줍니다.", `예) role="button", role="section", role="h1", ...`, "WAI-ARIA의 상태 속성을 사용하여 요소의 상태를 지정해줄 수 있습니다. 이번 문제에서는 따로 다루지 않습니다. ",
            "요소에 대한 정보를 전혀 알 수 없는 경우, 속성(property) 값을 주어 요소를 설명해줄 수 있습니다.", `예) aria-label="검색 버튼", aria-label="닫기 버튼", aria-label="뒤로 가기", ...`]
        },
        "6": {
            title: "표 구조 알기 쉽게 작성하기",
            content: [`테이블 요소 안에 <caption> 요소를 사용해서 표에 제목을 제공해줍니다.`, `표의 셀은 제목 셀과 데이터 셀이 구분되도록 구성해야 합니다. 제목 셀은 <th>, 데이터 셀은 <td> 를 사용하면 됩니다.`, "표의 구조가 복잡할 경우, 최대한 간소화하거나 scope, id, headers 속성을 사용하여 작성합니다."]
        },
        "7": {
            title: "레이블 작성법",
            content: [`<input>요소에 id를 설정하고 <label>요소의 for 속성으로 연결하기`, "title 속성 사용하기", "WAI-ARIA의 aria-label 속성 사용하기"]
        },
        "8": {
            title: "Cmarket Redux 리팩토링",
            content: ["학습한 내용을 바탕으로 Cmarket Redux의 웹 표준과 웹 접근성을 개선해보세요.", "시맨틱 요소만 잘 사용해줘도 웹 표준과 웹 접근성을 개선할 수 있습니다.", "웹 접근성은 모든 항목을 충족하려고 하지 않으셔도 괜찮습니다. 실습한 내용 안에서 할 수 있는 만큼만 개선해보세요."]
        }
    },
    tab: {
        tab1 : {
            title: "공지사항",
            content: ["휴가 기간 공지", "이벤트 당첨자 안내", "1주년 기념 이벤트"]
        },
        tab2 : {
            title: "상품페이지",
            content: ["2020년도 달력", "개구리 안대", "잉어 슈즈"]
        },
        tab3 : {
            title: "문의페이지",
            content: ["언제 출발해요", "결제가 안 돼요", "2020년도 달력 재입고 문의"]
        }
    }
}

export default data
