const Page01 = () => {
    return (
        <div className="article">
            <div className="title1">문제 1 : Semantic HTML</div>
            <div className="p">div 요소와 span 요소로도 화면을 구성할 수 있지만, 이 둘은 의미를 담고있지 않은 요소이기 때문에 각 요소가 어떤 기능을 하는지 요소의 이름만 보고서는 판단할 수 없습니다. 가능하다면 시맨틱 요소를 사용하여 웹 표준도 충족하고 의미있는 HTML을 구성하세요.<br/>
                우측 문제 가이드와 유어클래스 콘텐츠를 참고하여 각 요소들을 시맨틱한 요소로 변경하세요.</div>
            <ul>
                <li>개발자 콘솔의 Element 탭을 열고 요소들을 확인해보세요.</li>
                <li>시맨틱 요소가 아닌 div로 작성된 요소들을 확인하세요.</li>
                <li>우측 가이드를 참고하여 div 요소를 적합한 시맨틱 요소로 바꿔주세요.
                    <li>각 컴포넌트들, 메인 페이지, 현재 페이지를 수정해주시면 됩니다.</li>
                    <li>class 속성에 힌트가 있습니다.</li>
                    <li>class 이름이 container인 요소는 정렬을 위한 요소이므로 바꾸지 않아도 됩니다.</li>
                </li>
                <li>각 요소에 작성되어있던 class 속성을 없애주고, CSS 파일에서 class와 연결되어있던 스타일 속성들도 바뀐 요소에 맞춰 수정해주세요.
                    <li>이 단계를 제대로 진행하지 않으면 이후 문제들의 화면이 제대로 표시되지 않습니다. 꼭 잘 수정해주세요.</li>
                </li>
                <li>요소 종류를 바꾸기 이전과 똑같은 화면이 나오면 완료입니다!</li>
            </ul>
        </div>)
}

export default Page01